---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.ForwardIterator
source: html/52739e1c-8689-fc99-ed75-4a0c39bbe80a.htm
---
# Autodesk.Revit.DB.ReferencePointArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ReferencePointArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.